{
  "_class_name": "HunyuanVideoTransformer3DModel",
  "_diffusers_version": "0.32.0.dev0",
  "activation_fn": "gelu-approximate",
  "attention_head_dim": 88,
  "cross_attention_dim": 2048,
  "guidance_embeds": true,
  "hidden_size": 2048,
  "in_channels": 16,
  "mlp_ratio": 4.0,
  "norm_elementwise_affine": true,
  "norm_eps": 1e-06,
  "num_attention_heads": 24,
  "num_layers": 40,
  "num_refiner_layers": 2,
  "out_channels": 16,
  "patch_size": 2,
  "patch_size_t": 2,
  "pooled_projection_dim": 1024,
  "qdm_steps": 4,
  "rope_dim": 88,
  "rope_theta": 256,
  "sample_size": 128,
  "text_aggregation_mode": null,
  "use_linear_projection": true,
  "vocab_size": null
}
